sascha8a/cits-to-go/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c5"
CONFIG_IDF_TARGET_ESP32C5=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL=0
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_CITS_SERIAL_OUTPUT_USB_AND_UART=y
CONFIG_CITS_UART_PORT_NUM=1
CONFIG_CITS_UART_BAUD_RATE=921600
CONFIG_CITS_UART_TX_GPIO=0
CONFIG_CITS_UART_RX_GPIO=25
